---
kind: method
id: M:Autodesk.Revit.DB.SketchedStairsCurveData.Dispose
source: html/4b08ec4e-847c-8ed3-dbd3-ede59fc26a64.htm
---
# Autodesk.Revit.DB.SketchedStairsCurveData.Dispose Method

Releases all resources used by the SketchedStairsCurveData

## Syntax (C#)
```csharp
public void Dispose()
```